{
  "narrative": {
    "title": "Scene 7-1 — The Place That Lies Beyond",
    "paragraphs": [
      "Purple light drags them under the bed, and they roll to a stop. Flops lets out a moan. When they look up, a mountain-sized heap of broken toys rises around them; beyond it, they can see farther—rusted rails, factory with smokes from burning toys, and shadows that form scary corners. A train appears to be preparing to leave for the factory. Mechanical loaders  lift sacks, then toss them onto cars.  Theadora points to something colorful in one car. She recognizes the girl’s blanket sliding past.",
      "“What is this place?” someone whispers.",
      "Stitch answers, voice low. “This is the Fall.” They know they need to figure out a way to reach the train now or they lose the blanket to the cruel factory ahead."
    ],
    "vocabulary": [
      {
        "word": "moan",
        "definition": "a low, unhappy sound that shows pain or worry.",
        "examples": [
          "The wind began to moan around the empty house.",
          "He let out a moan when he stood up too fast."
        ]
      },
      {
        "word": "roll",
        "definition": "move by turning over and over, or by spinning on a surface.",
        "examples": [
          "The ball rolled under the couch.",
          "Clouds rolled in before the storm."
        ]
      },
      {
        "word": "appear to",
        "definition": "seem to be something based on what you see or know.",
        "examples": [
          "She appears to be tired today.",
          "The door appears to be stuck."
        ]
      },
      {
        "word": "heap",
        "definition": "a large, untidy pile of things.",
        "examples": [
          "Clothes lay in a heap on the chair.",
          "We climbed a heap of leaves."
        ]
      },
      {
        "word": "farther",
        "definition": "at a greater distance (physical space).",
        "examples": [
          "The lighthouse is farther down the coast.",
          "Walk farther to find the trail sign."
        ]
      },
      {
        "word": "cruel",
        "definition": "causing pain or not caring if others suffer.",
        "examples": [
          "A cruel joke made the child cry.",
          "The desert sun can be cruel at noon."
        ]
      },
      {
        "word": "form",
        "definition": "the shape or structure of something; or to create/shape something.",
        "examples": [
          "A dark form moved behind the curtain.",
          "Ice crystals form on the window."
        ]
      },
      {
        "word": "figure out",
        "definition": "to find an answer or understand something after thinking.",
        "examples": [
          "We need to figure out the code.",
          "She figured out where the noise came from."
        ]
      },
      {
        "word": "mechanical",
        "definition": "related to machines; done by or like a machine.",
        "examples": [
          "A mechanical arm lifted the boxes.",
          "He gave a mechanical nod."
        ]
      },
      {
        "word": "lift",
        "definition": "raise something higher.",
        "examples": [
          "Please lift the lid carefully.",
          "Two people lifted the sofa."
        ]
      },
      {
        "word": "toss",
        "definition": "throw something lightly or carelessly.",
        "examples": [
          "She tossed the keys to me.",
          "He tossed the ball in the air."
        ]
      },
      {
        "word": "recognize",
        "definition": "to know something because you have seen it before.",
        "examples": [
          "I recognized her voice at once.",
          "They recognized the tune from the radio."
        ]
      }
    ]
  },
  "timeline": {
    "events": [
      {
        "type": "anchor",
        "text": "A purple light pulls the team beneath the bed into somewhere else."
      },
      {
        "type": "blank",
        "text": "They tumble to a stop amid a towering pile of broken toys."
      },
      {
        "type": "blank",
        "text": "From a higher spot, they can see more of the wasteland and a factory complex."
      },
      {
        "type": "blank",
        "text": "A train in the yard looks ready to start moving toward the factory."
      },
      {
        "type": "anchor",
        "text": "Loaders throw sacks into the cars; the girl’s blanket is on one of the cars."
      },
      {
        "type": "blank",
        "text": "Theadora spots the blanket first and warns the others."
      },
      {
        "type": "blank",
        "text": "The team realizes they must reach the train immediately or it will be gone."
      }
    ],
    "distractors": [
      "Theadora finds the blanket lying near their landing place.",
      "Stitch is the one who notices the blanket first.",
      "The train stops and waits for the stuffies to climb aboard."
    ]
  }
}